examples/pressuretest/cpu_rhoPimpleFoam/Allrun
#!/usr/bin/env bash

case_dir="$(cd "$(dirname "${BASH_SOURCE[0]}")" && pwd)"
source "$(git -C "$(dirname "${BASH_SOURCE[0]}")" rev-parse --show-toplevel)/scripts/openfoam10-env.sh"
set -euo pipefail
cd "${case_dir}"

blockMesh > log.blockMesh 2>&1
exec /usr/bin/time -f 'elapsed_seconds=%e' -o runtime.cpu \
    rhoPimpleFoam > log.cpu 2>&1
